In [1]:
with open(r"D:\pythontext\data\sample.txt","r")as file:
    txt=file.read()

In [2]:
txt

'China Agricultural University Beijing Forestry University Beijing University of Agriculture Beijing Vocational College of Agriculture'

In [3]:
txt1=txt.split()

In [4]:
mydict={}

In [5]:
txt1

['China',
 'Agricultural',
 'University',
 'Beijing',
 'Forestry',
 'University',
 'Beijing',
 'University',
 'of',
 'Agriculture',
 'Beijing',
 'Vocational',
 'College',
 'of',
 'Agriculture']

In [9]:
for i in txt1:
    mydict[i]=mydict.get(i,0)+1
for k,v in sorted(mydict.items(),key=lambda x:x[1],reverse=True):
    print("{}出现{}次".format(k,v))

University出现9次
Beijing出现9次
of出现6次
Agriculture出现6次
China出现3次
Agricultural出现3次
Forestry出现3次
Vocational出现3次
College出现3次

In [7]:
len(txt1)

15

In [1]:
import pandas as pd
import numpy as np

In [9]:
with open(r"D:\pythontext\data\BP.txt","r")as file:
    txt=file.read()
txt

'1/5AM,136,76,73\n1/5PM,143,80,73\n2/5AM,135,82,68\n2/5PM,140,81,67\n3/5AM,142,76,67\n3/5PM,141,80,71\n4/5AM,138,77,74\n4/5PM,149,76,72\n'

In [15]:
txt1=txt.split("\n")
txt1

['1/5AM,136,76,73',
 '1/5PM,143,80,73',
 '2/5AM,135,82,68',
 '2/5PM,140,81,67',
 '3/5AM,142,76,67',
 '3/5PM,141,80,71',
 '4/5AM,138,77,74',
 '4/5PM,149,76,72',
 '']

In [21]:
txt2=pd.DataFrame(txt1)
txt2

                 0
0  1/5AM,136,76,73
1  1/5PM,143,80,73
2  2/5AM,135,82,68
3  2/5PM,140,81,67
4  3/5AM,142,76,67
5  3/5PM,141,80,71
6  4/5AM,138,77,74
7  4/5PM,149,76,72
8

In [25]:
txt1=pd.read_csv(r"D:\pythontext\data\BP.txt",header=None,names=["Data","SS","SZ","XL"])
txt1

    Data   SS  SZ  XL
0  1/5AM  136  76  73
1  1/5PM  143  80  73
2  2/5AM  135  82  68
3  2/5PM  140  81  67
4  3/5AM  142  76  67
5  3/5PM  141  80  71
6  4/5AM  138  77  74
7  4/5PM  149  76  72

In [41]:
a=txt1["SS"].max()
a

149

In [26]:
df1=txt1["SS"]
df1

0    136
1    143
2    135
3    140
4    142
5    141
6    138
7    149
Name: SS, dtype: int64

In [28]:
df1.max()

149

In [29]:
df2=txt1["SZ"]
df2.min()

76

In [30]:
df3=txt1["XL"]
df3.mean()

70.625

In [32]:
print("心率平均值",round(df3.mean(),1))

心率平均值 70.6

In [33]:
txt1["YC"]=txt1["SS"]-txt1["SZ"]

In [34]:
txt1

    Data   SS  SZ  XL  YC
0  1/5AM  136  76  73  60
1  1/5PM  143  80  73  63
2  2/5AM  135  82  68  53
3  2/5PM  140  81  67  59
4  3/5AM  142  76  67  66
5  3/5PM  141  80  71  61
6  4/5AM  138  77  74  61
7  4/5PM  149  76  72  73

In [36]:
txt2=pd.read_csv(r"D:\pythontext\data\E1.csv")
txt2.head()

  Gender  Height  Weight
0   Male     163      60
1   Male     164      56
2   Male     165      60
3   Male     168      55
4   Male     169      60

In [38]:
txt2.groupby("Gender")[["Height","Weight"]].mean()

            Height     Weight
Gender
Female  161.576923  50.115385
Male    172.923077  64.115385

In [40]:
txt2.describe()

           Height     Weight
count   52.000000  52.000000
mean   167.250000  57.115385
std      7.246027   9.434301
min    153.000000  38.000000
25%    161.750000  50.000000
50%    166.500000  58.000000
75%    173.000000  62.250000
max    183.000000  80.000000

In [42]:
txt2["Gender"]=txt2["Gender"].map({"Male":"0"})

In [43]:
txt2

   Gender  Height  Weight
0       0     163      60
1       0     164      56
2       0     165      60
3       0     168      55
4       0     169      60
5       0     170      54
6       0     170      80
7       0     170      64
8       0     171      67
9       0     172      65
10      0     172      60
11      0     172      60
12      0     173      60
13      0     173      62
14      0     174      65
15      0     175      70
16      0     175      70
17      0     175      65
18      0     175      60
19      0     175      62
20      0     176      58
21      0     178      70
22      0     178      75
23      0     180      63
24      0     180      71
25      0     183      75
26    NaN     153      42
27    NaN     156      44
28    NaN     156      38
29    NaN     157      48
30    NaN     158      52
31    NaN     158      45
32    NaN     159      43
33    NaN     160      50
34    NaN     160      45
35    NaN     160      52
36    NaN     160      50
37    NaN     161      50
38    NaN     161      45
39    NaN     162      55
40    NaN     162      60
41    NaN     163      56
42    NaN     163      56
43    NaN     163      59
44    NaN     164      55
45    NaN     164      47
46    NaN     165      45
47    NaN     165      45
48    NaN     165      60
49    NaN     168      58
50    NaN     168      49
51    NaN     170      54

In [44]:
import os

In [45]:
os.getcwd()

'C:\\Users\\15055'

In [47]:
txt2[txt2.Height==160]

   Gender  Height  Weight
33    NaN     160      50
34    NaN     160      45
35    NaN     160      52
36    NaN     160      50

In [50]:
txt2.sort_values(by="Height",axis=0,ascending=False).head()

   Gender  Height  Weight
25      0     183      75
24      0     180      71
23      0     180      63
22      0     178      75
21      0     178      70

In [1]:
s = "aaaabbbbbbbcceeeeeeeed"

In [4]:
mydict={}
for i in s:
    mydict[i]=mydict.get(i,0)+1
mydict

{'a': 4, 'b': 7, 'c': 2, 'e': 8, 'd': 1}

In [13]:
for k,v in mydict.items():
    print("{}c{}c".format(k,v))

ac4c
bc7c
cc2c
ec8c
dc1c

In [14]:
mydict.items()

dict_items([('a', 4), ('b', 7), ('c', 2), ('e', 8), ('d', 1)])

# 成绩排序

In [16]:
import random

In [17]:
mylist1=[]
for i in range(20):
    mylist1.append(random.randint(50,100))
mylist1

[92,
 66,
 64,
 52,
 80,
 65,
 73,
 95,
 69,
 68,
 54,
 81,
 52,
 77,
 99,
 75,
 92,
 78,
 94,
 84]

In [18]:
b=sum(mylist1)/len(mylist1)

In [19]:
b

75.5

In [22]:
mylist1[::-1]

[84,
 94,
 78,
 92,
 75,
 99,
 77,
 52,
 81,
 54,
 68,
 69,
 95,
 73,
 65,
 80,
 52,
 64,
 66,
 92]

In [23]:
sorted(mylist1)

[52,
 52,
 54,
 64,
 65,
 66,
 68,
 69,
 73,
 75,
 77,
 78,
 80,
 81,
 84,
 92,
 92,
 94,
 95,
 99]

# 编写一个函数，接收字符串参数，返回一个元组，元组的第一个值为大写字母的个数，第二个值为小写字母个数。并调用该函数。

In [34]:
def func(c):
    upper=0
    lower=0
    for i in c:
        if i.isupper():
            upper+=1
        if i.islower():
            lower+=1
    return upper,lower

In [36]:
c="sjfhajfbajwiJHFJjdjhKBJF"
a,b=func(c)
a

8

In [37]:
b

16

# 重复次数最多最少键值对

In [38]:
a=max()
b=min()
for k,v in mydict.items():
    if v==a:
        mylist_max.append(k,v)
    if v==b:
        mylist_min.append(k,v)

TypeError: max expected at least 1 argument, got 0

# 文本加序号

In [ ]:
with open(r" ...","r")as file:
    txt=file.readlines()  #读取
with open(r"...","w")as file:
    for i in range(len(txt)):
        file.write(str(i+1)+","+txt[i])

In [61]:
mylist1=[]
with open(r"D:\pythontext\data\stu_score.txt","r")as file:
    for i in file:
        mylist1.append(i.rstrip().split(","))
mylist1

[['20200001', '90', '96'],
 ['20200002', '61', '79'],
 ['20200003', '93', '91'],
 ['20200004', '50', '66'],
 ['20200005', '80', '70'],
 ['20200006', '77', '80'],
 ['20200007', '66', '88'],
 ['20200008', '88', '77'],
 ['20200009', '67', '54'],
 ['20200010', '42', '66']]

In [63]:
mylist1[1][1]

'61'

In [69]:
mylist2=[]
for i in mylist1:
    score1=eval(i[1])+eval(i[2])
    mylist2.append([i[0],score1])

In [70]:
mylist2

[['20200001', 186],
 ['20200002', 140],
 ['20200003', 184],
 ['20200004', 116],
 ['20200005', 150],
 ['20200006', 157],
 ['20200007', 154],
 ['20200008', 165],
 ['20200009', 121],
 ['20200010', 108]]

In [99]:
mylist1

[['20200001', '90', '96'],
 ['20200002', '61', '79'],
 ['20200003', '93', '91'],
 ['20200004', '50', '66'],
 ['20200005', '80', '70'],
 ['20200006', '77', '80'],
 ['20200007', '66', '88'],
 ['20200008', '88', '77'],
 ['20200009', '67', '54'],
 ['20200010', '42', '66']]

In [100]:
import pandas as pd

In [105]:
txt1=pd.read_csv("D:\pythontext\data\salaries.csv")
txt1.head()

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [106]:
txt1.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  397.000000     397.000000   397.000000     397.000000
mean   199.000000      22.314861    17.614610  113706.458438
std    114.748275      12.887003    13.006024   30289.038695
min      1.000000       1.000000     0.000000   57800.000000
25%    100.000000      12.000000     7.000000   91000.000000
50%    199.000000      21.000000    16.000000  107300.000000
75%    298.000000      32.000000    27.000000  134185.000000
max    397.000000      56.000000    60.000000  231545.000000

In [77]:
a=0
for i in range(2,1001,2):
    a=a+i
a

250500

In [94]:
a=0
for i in range(200,1,-1):
    if i%17==0:
        a=a+i
        break

In [95]:
a

187

In [98]:
for i in range(1,10,2):
    print(("*"*i).center(9))

    *
   ***
  *****
 *******
*********